app/views/products/show.html.erb

    <div class="span span4">
      <p class="left"><%= t ".size" %></p>
---
SELECT "sizes".* FROM "sizes" WHERE "sizes"."product_id" = ?  [["product_id", 1]]